Project3/app/views/posts/index.html.erb

        by <%= link_to post.user.username, posts_path(username: post.user.username) %> |
        <%= pluralize(post.comments.count, "comment") %> |
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]