Project3/app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 4], ["post_id", 4], ["content", "OOO"], ["created_at", "2024-10-24 23:27:17.187250"], ["updated_at", "2024-10-24 23:27:17.187250"]]

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def set_comment
    @comment = @post.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 3], ["id", 7], ["LIMIT", 1]]