Project3/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.order(created_at: :desc)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" ASC  [["post_id", 3]]
---
  def show
    @comment = Comment.new
    @comments = @post.comments.order(created_at: :asc)

INSERT INTO "posts" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 4], ["content", "HAYDAA"], ["created_at", "2024-10-24 23:25:54.253821"], ["updated_at", "2024-10-24 23:25:54.253821"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "aaa"], ["updated_at", "2024-10-24 23:42:42.900820"], ["id", 5]]
---
  def update
    if @post.update(post_params)