Project3/app/controllers/sessions_controller.rb

  def create
    username = params[:username].strip
    if username.blank?
      flash[:alert] = "Username cannot be blank."
      redirect_to login_path
      return
    end

    @user = User.find_by(username: username)

    if @user
      # Existing user, log them in
      session[:user_id] = @user.id
      flash[:notice] = "Logged in successfully."
    else
      # Create a new user and log them in
      @user = User.create(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ege"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["username", "ege"], ["created_at", "2024-10-24 22:56:09.409567"], ["updated_at", "2024-10-24 22:56:09.409567"]]